app/views/team/index.html.erb

                      <tbody>
                      <% @users = User.all %>
---
SELECT "users".* FROM "users"