app/controllers/profile_controller.rb

  def set_user
    if params[:id].nil? then
      @user = current_user
    else
      @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]