app/controllers/team_controller.rb

SELECT "users".* FROM "users"
---
  def index
    @team = User.descendants.paginate(:per_page => 15, :page => params[:page])