app/controllers/team_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
---
  def index
    respond_to do |format|
      format.html do
        @user = current_user
      	@team = @user.children.order(created_at: :desc).paginate(per_page: 15, page: params[:page])
        @ancestors = @user.ancestors.reverse.paginate(per_page: 15, page: params[:page])
        @foreign = false
      	render :index
      end
      format.js do
        # if params[:type] == 'partners'
        # TODO Need to fix search trought parents, not partners, and use different users
        @user = (true) ? current_user : User.find(params[:id])